In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

format_dict = {
              'price':'{:.2f}','unit_cost':'{:.2f}','qty':'{:,}',
              'amt':'{:,.2f}','gross':'{:,.2f}','net':'{:,.2f}','fee':'{:,.2f}','vat':'{:,.2f}'
              }

### Average cost calculation

In [16]:
name = 'SYNEX'

In [17]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

In [18]:
buys_grp = buys.groupby('name')[['gross','qty']].sum()
buys_grp['unit_cost'] = buys_grp.gross / buys_grp.qty
buys_grp.style.format(format_dict)

### Recalculate net cost by id

In [19]:
ids = buys['id']
ids

0    1110
1    1092
Name: id, dtype: int64

In [20]:
new_price = buys_grp.unit_cost.to_string(index=False)[5:]
new_price

'30.5'

In [21]:
def update_buys_by_id(new_price,id):
    sql = "UPDATE buys SET price = %s, fee = qty*price*.00207, vat = fee*.07, net = (qty*price)+fee+vat WHERE id = %s"
    sql = sql % (new_price,id)
    rp = conpf.execute(sql)
    return "Records updated = " + str(id)

In [22]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

In [23]:
i = 0
for id in ids:
    update_buys_by_id(new_price,id)
    i += 1

In [24]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)